app/controllers/convenios_controller.rb

SELECT "convenios".* FROM "convenios"  WHERE (uf like '%GOIAS%')  ORDER BY created_at DESC
SELECT "convenios".* FROM "convenios"
---
  def index

    if params[:search]
      @convenios = Convenio.search(params[:search]).order("created_at DESC")

    else
      @convenios = Convenio.all

SELECT  "convenios".* FROM "convenios"  WHERE "convenios"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_convenio
    @convenios = Convenio.find(params[:id])