app/controllers/home_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 3]]