app/controllers/usuarios_controller.rb

  def create
    @usuarios = Usuario.new(usuario_params)
    respond_to do |format|
      if @usuarios.save
---
INSERT INTO "usuarios" ("cpf", "created_at", "email", "login", "nome", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["cpf", "12345678900"], ["created_at", "2014-04-26 01:50:03.280341"], ["email", "a"], ["login", "a"], ["nome", "a"], ["senha", "a"], ["updated_at", "2014-04-26 01:50:03.280341"]]

  def destroy
    @usuarios.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]

  def update
    respond_to do |format|
      if @usuarios.update(usuario_params)
---
UPDATE "usuarios" SET "cpf" = ?, "login" = ?, "nome" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["cpf", "01920192019"], ["login", "thiagovsk"], ["nome", "auehauehau"], ["updated_at", "2014-05-01 02:17:38.692018"]]

  def set_usuario
    @usuarios = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = 1  ORDER BY "usuarios"."id" ASC LIMIT 1